//あとで大木さんのと繋げてください
//初期設定
enchant();

window.onload = function() {

  var core = new Core(320, 320);
  core.fps = 16;
  core.preload(
    'map1.png', 'chara0.png', 'chara5.png',
    'monster1.gif','monster3.gif','monster4.gif'
  );

  core.onload = function() {

    //初期表示のグループ化
    var stage = new Group();

    //戦闘マップを作成
    var map = new Map(16, 16); //mapの1タイルの表示サイズ
    map.image = core.assets['map1.png']; //mapの画像ファイル指定
    map.loadData(field.bg); //マップデータ読み込み
    stage.addChild(map); //stageにmapを加える

    //プレイヤーの作成
    var player = new Sprite(32, 32, map); //playerの表示サイズ
    player.image = core.assets['chara5.png']; //playerの画像ファイル指定
    player.frame = 22; //playerの画像フレーム番号
    player.x = 100; //playerを表示するx座標
    player.y = 160; //playerを表示するy座標
    stage.addChild(player); //stageにplayerを加える

    //enemysの作成
    var ene; //エネミーのデータを格納する変数
    ene = enemys[parseInt(Math.random()* 3)]; //enemysの3体のうち1体をランダムで設定
    //console.log(Math.random()* 3);
    //eneに設定されたエネミーデータを元にエネミーを作成する
    var enemy = new AvatarMonster(core.assets[ene.image]);
    enemy.frame = 3;
    enemy.x = 200;
    enemy.y = 160;
    enemy.name = ene.name;
    enemy.maxhp = ene.maxhp;
    enemy.hp = ene.hp;
    enemy.atk = ene.atk;
    enemy.spd = ene.spd;
    stage.addChild(enemy);

  core.rootScene.addChild(stage);
  }
  core.start();
}

/*
//プレイヤーを作成するクラス（失敗）
var Player = enchant.Class.create(enchant.Sprite, {
  initialize : function(x, y, map) {
    enchant.Sprite.call(this, 32, 32);
    this.x = x;
    this.y = y;
    var image = new Surface(96, 128);
    image.draw(core.assets['chara5.png'], 0, 0, 96, 128, 0, 0, 96, 128);
    this.image = image;
    this.isMoving = false; // 移動フラグ(移動中なら「true」)
    this.direction = 0; // 向き
    this.walk = 0; // 歩行アニメーションの基準フレーム番号を保持するプロパティ
    this.acount = 0; // 攻撃アクション中のフレーム数を保持するプロパティ
    // 「enterframe」イベントリスナ
    this.addEventListener('enterframe', function() {

      //プレイヤーの移動処理
    });
  }
});
*/
//バトルフィールドマップ(適当)
var field = {
  'bg' : [
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]
  ]
}
//戦闘シーンのanimals(プレイヤー操作側)とenemys(NPC)のデータテーブル(JSON)
/*記入データテンプレ(暫定)
image : キャラクターの画像ファイル名(後で追加)
name : キャラクターの名前
maxhp : キャクターの最大体力
hp : キャラクターの体力
atk : キャラクターの攻撃力
spd : キャクターの攻撃速度
*/
//animalsのデータテーブル(暫定)
var animals = {
  0 : {
    name : 'animalA',
    maxhp : 100,
    hp : 100,
    atk : 25,
    spd : 10
  },
  1 : {
    name : 'animalB',
    maxhp : 100,
    hp : 100,
    atk : 20,
    spd : 10
  },
  2 : {
    name : 'animalC',
    maxhp : 100,
    hp : 100,
    atk : 30,
    spd : 5
  }
}

//enemysのデータテーブル(暫定)
var enemys = {
  0 : {
    image : 'monster1.gif',
    name : 'enemyA',
    maxhp : 100,
    hp : 100,
    atk : 25,
    spd : 20
  },
  1 : {
    image : 'monster3.gif',
    name : 'enemyB',
    maxhp : 100,
    hp : 100,
    atk : 20,
    spd : 15
  },
  2 : {
    image : 'monster4.gif',
    name : 'enemyC',
    maxhp : 100,
    hp : 100,
    atk : 30,
    spd : 5
  }
}
